In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv("internetkullanimveri-temizlenmemis.csv")

In [3]:
data.info

<bound method DataFrame.info of     _id   tarih  android  apple  windows  linux  unknown  toplam  unnamed:_7  \
0     1  Oca.21     1528    320      108      2        0    1958         NaN
1     2  Žub.21     1861    360       88      2        0    2311         NaN
2     3  Mar.21     2196    463      171      6        1    2837         NaN
3     4  Nis.21     1882    385      126      2        0    2395         NaN
4     5  May.21     1813    358       87      4        0    2262         NaN
5     6  Haz.21     2692    565      176      1        1    3435         NaN
6     7  Tem.21     3204    744      141      2        0    4091         NaN
7     8  Ašu.21     2469    685      122      0        1    3277         NaN
8     9  Eyl.21     3160    600      112      2        0    3874         NaN
9    10  Eki.21     4149    805      689      1        0    5644         NaN
10   11  Kas.21     4087    738      854      0        1    5680         NaN
11   12  Ara.21     3871    691      668      2        0    5232         NaN
12   13  Oca.22     3568    637      573      1        0    4779         NaN
13   14  Žub.22     3331    526      805      2        0    4664         NaN

    unnamed:_8
0          NaN
1          NaN
2          NaN
3          NaN
4          NaN
5          NaN
6          NaN
7          NaN
8          NaN
9          NaN
10         NaN
11         NaN
12         NaN
13         NaN  >

In [4]:
data.head()

,_id,tarih,android,apple,windows,linux,unknown,toplam,unnamed:_7,unnamed:_8
0,1,Oca.21,1528,320,108,2,0,1958,NaN,NaN
1,2,Žub.21,1861,360,88,2,0,2311,NaN,NaN
2,3,Mar.21,2196,463,171,6,1,2837,NaN,NaN
3,4,Nis.21,1882,385,126,2,0,2395,NaN,NaN
4,5,May.21,1813,358,87,4,0,2262,NaN,NaN

In [5]:
data= data.drop(columns="_id", axis=0)

In [6]:
data= data.drop(columns="unnamed:_7", axis=0)

In [7]:
data= data.drop(columns="unnamed:_8", axis=0)

In [8]:
data[['ay', 'yıl']] = data["tarih"].astype('str').str.split(".", expand=True)

In [9]:
data= data.drop(columns="tarih", axis=0)

In [10]:
data["ay"] = data["ay"].replace({
    'Oca' : '01',
    'Žub' : '02',
    'Mar' : '03',
    'Nis' : '04',
    'May' : '05',
    'Haz' : '06',
    'Tem' : '07',
    'Ašu' : '08',
    'Eyl' : '09',
    'Eki' : '10',
    'Kas' : '11',
    'Ara' : '12'
})

In [11]:
data["yıl"] = data["yıl"].replace({
    '21' : '2021',
    '22' : '2022'
})

In [12]:
data.head()

   android  apple  windows  linux  unknown  toplam  ay   yıl
0     1528    320      108      2        0    1958  01  2021
1     1861    360       88      2        0    2311  02  2021
2     2196    463      171      6        1    2837  03  2021
3     1882    385      126      2        0    2395  04  2021
4     1813    358       87      4        0    2262  05  2021

In [13]:
data.rename(columns={"apple" : "ios"}, inplace=True)

In [14]:
data['Timestamp'] = pd.to_datetime(data['ay'] + '-' + data['yıl'].astype(str), format='%m-%Y')

In [15]:
data= data.drop(columns="ay", axis=0)
data= data.drop(columns="yıl", axis=0)

In [16]:
data.head()

   android  ios  windows  linux  unknown  toplam  Timestamp
0     1528  320      108      2        0    1958 2021-01-01
1     1861  360       88      2        0    2311 2021-02-01
2     2196  463      171      6        1    2837 2021-03-01
3     1882  385      126      2        0    2395 2021-04-01
4     1813  358       87      4        0    2262 2021-05-01

In [17]:
for index, row in data.iterrows():
    toplam_kontrol = row['android'] + row['ios'] + row['windows'] + row['linux'] + row['unknown']
    if toplam_kontrol != row['toplam']:
        print(f'toplam {index}. index için yanlış.')
    else:
        print(f'toplam {index}. index için doğru.')

toplam 0. index için doğru.
toplam 1. index için doğru.
toplam 2. index için doğru.
toplam 3. index için doğru.
toplam 4. index için doğru.
toplam 5. index için doğru.
toplam 6. index için doğru.
toplam 7. index için doğru.
toplam 8. index için doğru.
toplam 9. index için doğru.
toplam 10. index için doğru.
toplam 11. index için doğru.
toplam 12. index için doğru.
toplam 13. index için doğru.

In [18]:
data.head()

   android  ios  windows  linux  unknown  toplam  Timestamp
0     1528  320      108      2        0    1958 2021-01-01
1     1861  360       88      2        0    2311 2021-02-01
2     2196  463      171      6        1    2837 2021-03-01
3     1882  385      126      2        0    2395 2021-04-01
4     1813  358       87      4        0    2262 2021-05-01

In [19]:
data.to_csv("/Users/o/Desktop/acik-veri-calismalari/ucretsiz-wifi-kullanim-sayilari/ucretsiz-wifi-kullanim-sayilari.csv")
data.to_excel("/Users/o/Desktop/acik-veri-calismalari/ucretsiz-wifi-kullanim-sayilari/ucretsiz-wifi-kullanim-sayilari.xlsx")